;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! elfeed-protocol)
(package! elfeed-goodies)
(package! org-protocol-capture-html :recipe (:host github :repo "alphapapa/org-protocol-capture-html"))
(package! docker-compose-mode)
(package! nginx-mode)
(package! fish-mode)
(package! salt-mode)
(package! fountain-mode)
(package! org-ref)
